CDMDEV1/src/InformationRegisters/НастройкиИБИОбменов/НастройкиИБИОбменов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиИБИОбменов</name>
  <resources>
    <name>Актуальность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ПараметрыЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Обмен</name>
    <type>
      <types>CatalogRef.ОбменыДанных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БазаДанныхДляОбмена</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

CDMDEV1/src/Catalogs/ИнформационныеБазы/ИнформационныеБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеБазы</name>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>СерверПриложений</name>
    <type>
      <types>CatalogRef.СерверПриложений</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьНаВебСервере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Конфигурация</name>
    <type>
      <types>EnumRef.КонфигурацииИнформационныхБаз</types>
    </type>
  </attributes>
  <attributes>
    <name>Тестовая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Среда</name>
    <type>
      <types>EnumRef.Среда</types>
    </type>
  </attributes>
  <attributes>
    <name>Контур</name>
    <type>
      <types>CatalogRef.Контур</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
</mdclass:Catalog>

CDMDEV1/src/InformationRegisters/НастройкиИБИОбменов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Дополняет записи по обработчику всеми продуктивными базами  
//
// Параметры:
//  Обработчик - СправочникСсылка.ОбменыДанных - элемент справочника "Обмены и обработчики данных". 
//
Процедура ДополнитьСписокПродуктивнымиБазами(Обработчик) Экспорт
	
	Если Не ЗначениеЗаполнено(Обработчик) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиИБИОбменов.БазаДанныхДляОбмена КАК БазаДанныхДляОбмена
		|ПОМЕСТИТЬ ТекущиеНастройки
		|ИЗ
		|	РегистрСведений.НастройкиИБИОбменов КАК НастройкиИБИОбменов
		|ГДЕ
		|	НастройкиИБИОбменов.Обмен = &Обмен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИнформационныеБазы.Ссылка КАК БазаДанныхДляОбмена,
		|	&Обмен КАК Обмен,
		|	Истина КАК Актуальность
		|ИЗ
		|	Справочник.ИнформационныеБазы КАК ИнформационныеБазы
		|ГДЕ
		|	НЕ ИнформационныеБазы.ПометкаУдаления
		|	И НЕ ИнформационныеБазы.Тестовая
		|	И ИнформационныеБазы.Среда = ЗНАЧЕНИЕ(Перечисление.Среда.Prod)
		|	И НЕ ИнформационныеБазы.Ссылка В
		|				(ВЫБРАТЬ
		|					ТекущиеНастройки.БазаДанныхДляОбмена КАК БазаДанныхДляОбмена
		|				ИЗ
		|					ТекущиеНастройки КАК ТекущиеНастройки)";
	
	Запрос.УстановитьПараметр("Обмен", Обработчик);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяНастройка = РегистрыСведений.НастройкиИБИОбменов.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(НоваяНастройка, Выборка);
		НоваяНастройка.Записать();
	КонецЦикла;
	
КонецПроцедуры    

// Добавляет во все записи по обработчику параметры запроса   
//
// Параметры:
//  Обработчик - СправочникСсылка.ОбменыДанных - элемент справочника "Обмены и обработчики данных". 
//  Параметры - Структура - параметры запроса, сериализуемые в JSON. 
//
Процедура ДобавитьПараметрыЗапроса(Обработчик, Параметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Обработчик) И Не (ТипЗнч(Параметры) = Тип("Структура") И Параметры.Количество()) Тогда
		Возврат;
	КонецЕсли; 
	
	ПараметрыЗапроса = ЗаписатьЗначениеJSON(Параметры);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиИБИОбменов.БазаДанныхДляОбмена КАК БазаДанныхДляОбмена
		|ИЗ
		|	РегистрСведений.НастройкиИБИОбменов КАК НастройкиИБИОбменов
		|ГДЕ
		|	НастройкиИБИОбменов.Обмен = &Обмен";
	
	Запрос.УстановитьПараметр("Обмен", Обработчик);
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл  
		
		Менеджер = СоздатьМенеджерЗаписи();	
		Менеджер.Обмен = Обработчик;
		Менеджер.БазаДанныхДляОбмена = Выборка.БазаДанныхДляОбмена;    
		Менеджер.Прочитать();
		Если Менеджер.Выбран() Тогда
			Менеджер.ПараметрыЗапроса = ПараметрыЗапроса;
			Менеджер.Записать();
		КонецЕсли;
		
	КонецЦикла;   
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти

#КонецЕсли
